darwinbeing/HPServerPSUHack/references/dpsk3-power-buck-average-current-mode-control-1.0.1/dpsk_buck_acmc.X/sources/common/p33c_pral/p33c_adc.c
/*LICENSE *****************************************************************************************
 *
 * Software License Agreement
 *
 * Copyright (R) 2012 Microchip Technology Inc.  All rights reserved. Microchip licenses to you the
 * right to use, modify, copy and distribute Software only when embedded on a Microchip 
 * microcontroller or digital signal controller, which is integrated into your product or third 
 * party product (pursuant to the sublicense terms in the accompanying license agreement).
 *
 * You should refer to the license agreement accompanying this Software for additional information 
 * regarding your rights and obligations.
 *
 * SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR 
 * IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT 
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR
 * OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR 
 * OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT  
 * LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, LOST PROFITS  
 * OR LOST DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY  
 * THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
 *
 * ***********************************************************************************************/

// Include Header Files
#include "p33c_adc.h"

/*!p33EGS_adc.c
 * ************************************************************************************************
 * Summary:
 * Driver file for the dsPIC33ExxGS-ADC SFRs
 *
 * Description:
 * The SMPS ADC module offers a number of registers and configuration options. This additional
 * driver file contains initialization routines for all majority required settings.
 * ***********************************************************************************************/

volatile uint16_t adcc_usage=0; // Private variable tracking the ADC cores in use while
                                // ADC inputs and the module gets initialized

/*!hsadc_module_power_up()
 * *****************************************************************************************************
 * Summary:
 * Turns on the base power of the ADC module 
 *
 * Parameters: 
 *   (none)
 *
 * Description:
 * 
 * *****************************************************************************************************/

volatile uint16_t ADC_Module_PowerUp(void)
{
    volatile uint16_t fres=1;

    #ifdef PMDCON
    _PMDLOCK = 1; // Peripheral Module Disable-bits (1=can be set, 0=cannot be set) in software
    #endif
    #if defined (_ABGMD)
    _ABGMD = 0;         // Turn on power to analog bandgap reference
    fres &= (1-_ABGMD);
    #endif
    #if defined (_ADCMD)
    _ADCMD = 0; 		// Turn on power to ADC module
    fres &= (1-_ADCMD);
    #elif defined (_ADC1MD)
    _ADC1MD = 0; 		// Turn on power to ADC module
    fres &= (1-_ADC1MD);
    #endif
    #ifdef PMDCON
    _PMDLOCK = 0; // Peripheral Module Disable-bits (1=can be set, 0=cannot be set) in software
    #endif

    return(fres);

} 

/*!hsadc_module_power_down()
 * *****************************************************************************************************
 * Summary:
 * Turns off the base power of the ADC module 
 *
 * Parameters: 
 *   (none)
 *
 * Description:
 * 
 * *****************************************************************************************************/

volatile uint16_t ADC_Module_PowerDown(void)
{
    volatile uint16_t fres=1;
    
    Nop();  // No-Operation Instructions required to ensure proper register access
    Nop();  // DO NOT REMOVE
    Nop();  // *******************************************************************

    #ifdef PMDCON
    _PMDLOCK = 1; // Peripheral Module Disable-bits (1=can be set, 0=cannot be set) in software
    #endif
    #if defined (_ABGMD)
    _ABGMD = 1;         // Turn off power to analog bandgap reference
    fres &= (_ABGMD);
    #endif
    #if defined (_ADCMD)
    _ADCMD = 1; 		// Turn off power to PWM channel #1
    fres &= (_ADCMD);
    #elif defined (_ADC1MD)
    _ADC1MD = 1; 		// Turn off power to PWM channel #1
    fres &= (_ADC1MD);
    #else
    fres = 0;
    #endif
    #ifdef PMDCON
    _PMDLOCK = 0; // Peripheral Module Disable-bits (1=can be set, 0=cannot be set) in software
    #endif
    return(fres);

}

/*!hsadc_init_adc_module
 * ************************************************************************************************
 * Summary:
 * Initializes the basic ADC configuration
 *
 * Parameters:
 *	HSADC_MODULE_CONFIG_t adc_cfg = holds the register value for module base registers
 *
 * Description:
 * Basic options like clock source, early interrupts, format options, sampling order and modes
 * are set here.
 * ***********************************************************************************************/
volatile uint16_t ADC_Module_Initialize( volatile HSADC_ADMODCFG_t adc_cfg )
{
    volatile uint16_t fres = 1;
    
    // Ensure ADC module is powered up before registers are written
    fres &= ADC_Module_PowerUp();
    
	// Reset all ADC configuration registers to defaults
    fres &= ADC_Module_Reset();
    
	// Setting ADC configuration block #1 according to user settings.
	// Please note:
	//   ADC ENABLE is ALWAYS masked out! 
    //   The ADC has to be enabled later during the configuration process.

    _ADON = ADCON1_ADON_DISABLED; // Always disable the ADC converter peripheral while being configured
    _ADSIDL = adc_cfg.config.adsidl;   // Set ADC Stop in Idle Mode bit

    _REFSEL = adc_cfg.refcfg.refsel; // ADC Reference Voltage Selection bits
    _REFCIE = adc_cfg.refcfg.refcie; // Band Gap and Reference Voltage Ready Common Interrupt Enable bit
    _REFERCIE = adc_cfg.refcfg.refercie; // Band Gap or Reference Voltage Error Common Interrupt Enable bit
    _WARMTIME = adc_cfg.config.warmtime;

    _FORM = adc_cfg.config.form;   // Set Fractional Data Output Format bit
    _EIEN = adc_cfg.config.eien;   // Set Early Interrupts Enable bit
    ADCON2Lbits.PTGEN = adc_cfg.config.ptgen; // Set External Conversion Request Interface bit
    
    _CNVCHSEL = adc_cfg.swtrig.cnvchsel; // Channel Number Selection for Software Individual Channel Conversion Trigger bits
    _SUSPEND = adc_cfg.swtrig.suspend; // All ADC Core Triggers Disable bit
    _SUSPCIE = adc_cfg.swtrig.suspcie; // Suspend All ADC Cores Common Interrupt Enable bit
   
    ADCON3Hbits.CLKSEL = adc_cfg.cores.clksel;  // Set ADC Module Clock Source Selection bits
    ADCON3Hbits.CLKDIV = adc_cfg.cores.clkdiv;  // Set ADC Module Clock Source Divider bits

