darwinbeing/HPServerPSUHack/references/dpsk3-power-buck-average-current-mode-control-1.0.1/dpsk_buck_acmc.X/sources/common/p33c_pral/p33c_adc.c
    _SHRADCS = adc_cfg.cores.shared_core.adcs;  // Shared ADC Core Input Clock Divider bits
    _SHRRES = adc_cfg.cores.shared_core.res;    // Shared ADC Core Resolution Selection bits
    _SHRSAMC = adc_cfg.cores.shared_core.samc;  // Shared ADC Core Sample Time Selection bits
    _SHREISEL = adc_cfg.cores.shared_core.eisel; // Shared Core Early Interrupt Time Selection bits
    
    #if defined (ADCORE0L)
    ADCORE0Hbits.ADCS = adc_cfg.cores.core0.adcs;       // Dedicated ADC Core x Input Clock Divider bits
    ADCORE0Hbits.RES = adc_cfg.cores.core0.res;         // Dedicated ADC Core x Resolution Selection bits
    ADCORE0Hbits.EISEL = adc_cfg.cores.core0.eisel;     // Dedicated ADC Core x Early Interrupt Time Selection bits
    ADCORE0Lbits.SAMC = adc_cfg.cores.core0.samc;       // Dedicated ADC Core x Conversion Delay Selection bits
    ADCON4Lbits.SAMC0EN = adc_cfg.cores.core0.samc_en;  // Dedicated ADC Core x Conversion Delay Enable bit
    #endif
    #if defined (ADCORE1L)
    ADCORE1Hbits.ADCS = adc_cfg.cores.core1.adcs;       // Dedicated ADC Core x Input Clock Divider bits
    ADCORE1Hbits.RES = adc_cfg.cores.core1.res;         // Dedicated ADC Core x Resolution Selection bits
    ADCORE1Hbits.EISEL = adc_cfg.cores.core1.eisel;     // Dedicated ADC Core x Early Interrupt Time Selection bits
    ADCORE1Lbits.SAMC = adc_cfg.cores.core1.samc;       // Dedicated ADC Core x Conversion Delay Selection bits
    ADCON4Lbits.SAMC0EN = adc_cfg.cores.core1.samc_en;  // Dedicated ADC Core x Conversion Delay Enable bit
    #endif
    #if defined (ADCORE2L)
    ADCORE2Hbits.ADCS = adc_cfg.cores.core2.adcs;       // Dedicated ADC Core x Input Clock Divider bits
    ADCORE2Hbits.RES = adc_cfg.cores.core2.res;         // Dedicated ADC Core x Resolution Selection bits
    ADCORE2Hbits.EISEL = adc_cfg.cores.core2.eisel;     // Dedicated ADC Core x Early Interrupt Time Selection bits
    ADCORE2Lbits.SAMC = adc_cfg.cores.core2.samc;       // Dedicated ADC Core x Conversion Delay Selection bits
    ADCON4Lbits.SAMC0EN = adc_cfg.cores.core2.samc_en;  // Dedicated ADC Core x Conversion Delay Enable bit
    #endif

    
    // Return 1=success, 0=failure
	return(fres);

}


/*!hsadc_init_adc_channel
 * ************************************************************************************************
 * Summary:
 * Initializes an individual ADC input configuration
 *
 * Parameters:
 *	HSADC_CHANNEL_CONFIG_t = holds all available settings of one ADC input (e.g. AN3)
 *
 * Description:
 * This routine configures the individual settings of an analog input .
 * ***********************************************************************************************/

volatile uint16_t ADC_ADInput_Initialize( volatile HSADC_ADCANCFG_t adin_cfg ) {
    
    volatile uint16_t fres = 1;
    
    // Check if given analog input number is available
    if(adin_cfg.ad_input > ADC_ANINPUT_COUNT) { return(0); }
    
    // Track ADC cores in use
    adcc_usage |= (0x0001 << adin_cfg.config.core_index);

    // Set AD input mode (differential or single ended) and 
    // Conversion data output format (signed/unsigned)
    fres &= ADC_ADInput_SetMode(adin_cfg);

    // Set interrupt enable and early interrupt enable
    fres &= ADC_ADInput_SetInterrupt(adin_cfg);
    
    // Set interrupt trigger mode (level/edge)
    fres &= ADC_ADInput_SetTriggerMode(adin_cfg);

    // Set interrupt trigger source
    fres &= ADC_ADInput_SetTriggerSource(adin_cfg);

    
    return(fres);
    
}

/*!hsadc_module_enable()
 * ************************************************************************************************
 * Summary:
 * Enables the ADC module
 *
 * Parameters: (none)
 *
 * Description:
 * The ADC module has a start-up time of a couple of micro seconds. Therefore the 
 * enable-instruction is followed by a short delay loop.
 * ***********************************************************************************************/

volatile uint16_t ADC_Module_Enable(void)
{
    volatile uint16_t fres=1;
    volatile uint16_t i=0;
    volatile uint16_t adcore_check=0;
    
	_ADON = ADC_ON; // Enable ADC module
    fres &= _ADON;  // Check if ADC module is enabled
    
    // Enable all ADC cores
    for (i=0; i<ADC_CORE_COUNT; i++) { // Check which of the ADC cores need to be enabled
        adcore_check = (adcc_usage & (0x0001 << i)); // User ADC Core tracking variable to identify active cores
        if (adcore_check)
        { fres &= ADC_Core_PowerUp(i); } // enable active ADC core
    }
    
	return(fres);
	 
}

/*!hsadc_module_disable()
 * ************************************************************************************************
 * Summary:
 * Disables the ADC module
 *
 * Parameters: (none)
 *
 * Description:
 * Disables the entire ADC module, which will also affect the port registers. Fault states 
 * at certain pins will be lost as every pin will be re-configured as GPIO.
 * ***********************************************************************************************/

volatile uint16_t ADC_Module_Disable(void)
{

	ADCON1Lbits.ADON = ADC_OFF;			// Disable ADC module 
	return(1 - ADCON1Lbits.ADON);

}

/*!hsadc_reset()
 * ************************************************************************************************
 * Summary:
 * Resets ADC configuration
 *
 * Parameters:	(none)
 *
 * Description:
 * Resets the entire ADC configuration including the port control registers. All ANx-inputs will
 * become GPIOs.
 * ***********************************************************************************************/

volatile uint16_t ADC_Module_Reset(void) {
    
    /* ToDo: Add register contents check after WRITE */
    
	// Reset all ADC configuration registers to defaults

	ADCON1Lbits.ADON = ADC_OFF;         // Disable ADC
  
	ADCON1L	   = REG_ADCON1L_RESET;     // Disable and reset ADC configuration register 1 low
	ADCON1H	   = REG_ADCON1H_RESET;     // Disable and reset ADC configuration register 1 high
	ADCON2L	   = REG_ADCON2L_RESET;     // Disable and reset ADC configuration register 2 low
	ADCON2H	   = REG_ADCON2H_RESET;     // Disable and reset ADC configuration register 2 high
    ADCON3L    = REG_ADCON3L_RESET;     // Disable and reset ADC configuration register 3 low
    ADCON3H    = REG_ADCON3H_RESET;     // Disable and reset ADC configuration register 3 high
    #if defined (ADCON4L)     
    ADCON4L    = REG_ADCON4L_RESET;     // Disable and reset ADC configuration register 4 low
    #endif     
    #if defined (ADCON4H)     
    ADCON4H    = REG_ADCON4H_RESET;     // Disable and reset ADC configuration register 4 high
    #endif     
    ADCON5L    = REG_ADCON5L_RESET;     // Disable and reset ADC configuration register 5 low
    ADCON5H    = REG_ADCON5H_RESET;     // Disable and reset ADC configuration register 5 high

    // Reset registers for ADC input channels and sub-modules
    ADMOD0L    = REG_ADMOD0L_RESET;     // Disable and reset ADC INPUT MODE CONTROL REGISTER 0 LOW
    ADMOD0H    = REG_ADMOD0H_RESET;     // Disable and reset ADC INPUT MODE CONTROL REGISTER 0 HIGH
    ADMOD1L    = REG_ADMOD1L_RESET;     // Disable and reset ADC INPUT MODE CONTROL REGISTER 1 LOW
    #ifdef ADMOD1H
    ADMOD1H    = REG_ADMOD1H_RESET;     // Disable and reset ADC INPUT MODE CONTROL REGISTER 1 HIGH     
    #endif
    ADIEL      = REG_ADIEL_RESET;       // Disable and reset ADC INTERRUPT ENABLE REGISTER LOW
    ADIEH      = REG_ADIEH_RESET;       // Disable and reset ADC INTERRUPT ENABLE REGISTER HIGH
    ADSTATL    = REG_ADSTATL_RESET;     // Disable and reset ADC DATA READY STATUS REGISTER LOW 
    ADSTATH    = REG_ADSTATH_RESET;     // Disable and reset ADC DATA READY STATUS REGISTER HIGH 
    ADEIEL     = REG_ADEIEL_RESET;      // Disable and reset ADC EARLY INTERRUPT ENABLE REGISTER LOW 
    ADEIEH     = REG_ADEIEH_RESET;      // Disable and reset ADC EARLY INTERRUPT ENABLE REGISTER HIGH 
    ADEISTATL  = REG_ADEISTATL_RESET;   // Disable and reset ADC EARLY INTERRUPT STATUS REGISTER LOW
    ADEISTATH  = REG_ADEISTATH_RESET;   // Disable and reset ADC EARLY INTERRUPT STATUS REGISTER HIGH

