darwinbeing/HPServerPSUHack/references/dpsk3-power-buck-average-current-mode-control-1.0.1/dpsk_buck_acmc.X/sources/common/p33c_pral/p33c_adc.c
    ADLVLTRGL  = REG_ADLVLTRGL_RESET;   // Disable and reset ADC LEVEL-SENSITIVE TRIGGER CONTROL REGISTER LOW
    ADLVLTRGH  = REG_ADLVLTRGH_RESET;   // Disable and reset ADC LEVEL-SENSITIVE TRIGGER CONTROL REGISTER HIGH
    
    // Reset ADC core usage tracking variable
    adcc_usage = 0;
    
	return(1);
}

/*!hsadc_adc_cores_check_ready()
 * ************************************************************************************************
 * Summary:
 * Checks the 'READY' status of all powered ADC cores
 *
 * Parameters:	(none)
 * 
 * Returns:
 *      0: Failure
 *      1: Success
 *
 * Description:
 * Each ADC core of the dsPIC33E and dsPIC33C family of devices can be powered and enabled
 * individually. The READY bit indicates, if the core is powered and the configured WARMTIME 
 * has passed, so that the converter is ready to be used. 
 * This routine compares if all READY bits for all POWERED ADC cores are set and returns
 * an OK/NOT_READY response.
 * ***********************************************************************************************/

volatile uint16_t ADC_Core_CheckReady(void)
{
    volatile uint16_t fres = 1;
    volatile uint16_t timeout = 0;
    volatile uint16_t rdy_compare = 0;
    volatile uint16_t reg_buf = 0;

    /* ToDo: Add register contents check after WRITE */

    fres &= _REFRDY;     // Check if Band Gap reference is running and ready
    fres &= (1-_REFERR); // Check if Band Gap reference indicating error
    
    reg_buf = (ADCON5L & 0x00FF); // Capture enabled and powered ADC core bits
    rdy_compare = ((reg_buf << 8) | reg_buf); // Set filter mask for ADC CORE READY bits

    while( (ADCON5L != rdy_compare) && (timeout++ < 0xFFFE) );
    if(timeout == 0xFFFF) { fres = 0; }

    return(fres);
}

/*!hsadc_adc_core_power_on()
 * ************************************************************************************************
 * Summary:
 * Turns on a single ADC core
 *
 * Parameters:	
 *      - uint16_t index:   Index of an individual ADC core
 *
 * Returns:
 *      0: Failure
 *      1: Success
 * 
 * Description:
 * The individual ADC cores of the ADC peripheral can be individually turned on and off. 
 * This function will turned on the power to an ADC core determined by the parameter 'index'.
 * The turn-on sequence is 
 *      (1) enabling the power to the ADC core
 *      (2) wait until AdC core is ready
 *      (3) Set Enable bit of the ADC core
 * 
 * ***********************************************************************************************/

volatile uint16_t ADC_Core_PowerUp(volatile uint16_t index)
{
    volatile uint16_t fres=1;
    volatile uint16_t *regptr;
    volatile uint16_t reg_buf=0;
    volatile uint16_t timeout=0;

    /* ToDo: Add register contents check after WRITE */
    
    if (index >= ADC_CORE_COUNT) return(0);
    
    regptr = (volatile uint16_t *)&ADCON5L;
    
    // Power on ADC core x 
    if(index == ADC_SHARED_CORE_INDEX) { 
      // Shared Core Power Setting is located in Bit #7, while all others are 
      // enumerated on Bits #0 = dedicated core #0, #1 = dedicated core #1, etc
        reg_buf  = (REG_ADCON5L_SHRPWR_ON & REG_ADCON5L_VALID_DATA_WRITE_MSK);
        
    }
    else {
      // Dedicated core power on enable bits are set based on the index/bit position 
        reg_buf  = ((0x0001 << index) & REG_ADCON5L_VALID_DATA_WRITE_MSK);
    }

    if(!(*regptr & reg_buf)) // if bit hasn't been set yet...
    { *regptr |= reg_buf; } // write to register
    fres &= (volatile bool)((*regptr & reg_buf) == reg_buf);

    // Check READY status of powered-up ADC core
    reg_buf <<= 8;   // Shift selected bit up into the high-word of ADCON5L for the status check
    while(!(ADCON5L & reg_buf) && (timeout++ < 0xFFFE) );
    if(timeout == 0xFFFF) return(0);
    
    // Set pointer onto ADC core enable register ADCON3H
    regptr = (volatile uint16_t *)&ADCON3H;
    
    // Power on ADC core x 
    if(index == ADC_SHARED_CORE_INDEX) { 
      // Shared Core Power Setting is located in Bit #7, while all others are 
      // enumerated on Bits #0 = dedicated core #0, #1 = dedicated core #1, etc
        reg_buf  = (REG_ADCON3H_SHREN_ENABLED & REG_ADCON3H_VALID_DATA_WRITE_MSK);
        
    }
    else {
      // Dedicated core power on enable bits are set based on the index/bit position 
        reg_buf  = ((0x0001 << index) & REG_ADCON3H_VALID_DATA_WRITE_MSK);
    }

    if(!(*regptr & reg_buf)) // if bit hasn't been set yet...
    { *regptr |= reg_buf; } // write to register
    fres &= (volatile bool)((*regptr & reg_buf) == reg_buf);
    
	return(fres);
	
}

/*!hsadc_set_adc_input_trigger_source()
 * ************************************************************************************************
 * Summary:
 * Configures interrupt trigger source setting of an individual analog input
 *
 * Parameters:
 *     - HSADC_ADCAN_CONFIG_t adin_cfg  // ADC input channel settings data structure
 *
 * Returns: 
 *      0: failure
 *      1: success
 * 
 * Description:
 * This function configures the trigger source selection for corresponding analog inputs by
 * extracting the user setting from the function parameter adin_cfg.config.trigger_source 
 * stored in the adin_cfg data structure.
 * 
 * ***********************************************************************************************/

volatile uint16_t ADC_ADInput_SetTriggerSource(volatile HSADC_ADCANCFG_t adin_cfg)
{
    volatile uint16_t fres = 1;
    volatile uint8_t *regptr;
    
    // Check if given ADC input index is within available range
    if (adin_cfg.ad_input >= ADC_ANINPUT_COUNT) return(0);

    // Determine register set offset
    regptr = (volatile uint8_t *)&ADTRIG0L; // get register block base address
    regptr += (volatile uint8_t)adin_cfg.ad_input;   // add offset
    *regptr = (volatile uint8_t)adin_cfg.config.trigger_source;
    
    // Check if WRITE operation was successful
    fres &= (volatile bool)((*regptr == (volatile uint8_t)adin_cfg.config.trigger_source));  

    return(1);
}

/*!hsadc_set_adc_input_interrupt()
 * ************************************************************************************************
 * Summary:
 * configures the interrupt generation of a single ADC core
 *
 * Parameters:	
 *     - HSADC_ADCAN_CONFIG_t adin_cfg  // ADC input channel settings data structure
 * 
 * Returns:
 *     0: failure
 *     1: success
 * 
 * Description:
 * The individual ADC cores of the ADC peripheral support the generation of interrupts. Further
 * Those interrupts can be "pulled-in" to compensate the interrupt latency of the controller
 * ***********************************************************************************************/

volatile uint16_t ADC_ADInput_SetInterrupt(volatile HSADC_ADCANCFG_t adin_cfg)
{
    volatile uint16_t fres = 1;
    volatile uint16_t ad_idx = 0;
    volatile uint16_t reg_val = 0;
    
