darwinbeing/HPServerPSUHack/references/dpsk3-power-buck-average-current-mode-control-1.0.1/dpsk_buck_acmc.X/sources/common/p33c_pral/p33c_adc.c
    /* ToDo: Add register contents check after WRITE */
    
    if (adin_cfg.ad_input >= ADC_ANINPUT_COUNT) 
        return(0);
    
    ad_idx = (volatile uint16_t)adin_cfg.ad_input;

    if (ad_idx<16) {   

        // Setting the Early Interrupt Enable Bit
        reg_val = (volatile uint16_t)adin_cfg.config.early_interrupt_enable;
        reg_val <<= ad_idx;
        ADEIEL |= (reg_val & REG_ADEIEL_VALID_DATA_MSK); 
        fres &= (volatile bool)((ADEIEL & reg_val) == reg_val);

        // Setting the Interrupt Enable Bit
        reg_val = (volatile uint16_t)adin_cfg.config.interrupt_enable;
        reg_val <<= ad_idx;
        ADIEL |= (reg_val & REG_ADIEL_VALID_DATA_MSK); 
        fres &= (volatile bool)((ADIEL & reg_val) == reg_val);
        
    }
    else {

        ad_idx -= 16; // Shift analog input channel bit back to position zero

        #ifdef ADEIEH
        // Setting the Early Interrupt Enable Bit
        reg_val = (volatile uint16_t)adin_cfg.config.early_interrupt_enable;
        reg_val <<= ad_idx;
        reg_val &= REG_ADEIEH_VALID_DATA_MSK; 
        ADEIEH |= reg_val; 
        fres &= (volatile bool)((ADEIEH & reg_val) == reg_val);
        
        // Setting the Interrupt Enable Bit
        reg_val = (volatile uint16_t)adin_cfg.config.interrupt_enable;
        reg_val <<= ad_idx;
        ADIEH |= (reg_val & REG_ADIEH_VALID_DATA_MSK); 
        fres &= (volatile bool)((ADIEH & reg_val) == reg_val);
        
        #else
        return(0);
        #endif
    }
    
        
	return(fres);
	
}

/*!hsadc_set_adc_input_trigger_mode()
 * ************************************************************************************************
 * Summary:
 * Configures the trigger mode of an individual analog input
 *
 * Parameters:	
 *     - HSADC_ADCAN_CONFIG_t adin_cfg  // ADC input channel settings data structure
 *
 * Returns:
 *     0: failure
 *     1: success
 * 
 * Description:
 * The individual analog inputs of the dsPIC can be triggered by many different sources
 * specified by the trigger source (see function hsadc_set_adc_input_trigger_source()).
 * This function is used to enable the desired trigger mode by setting the related 
 * register bits.
 * ***********************************************************************************************/

volatile uint16_t ADC_ADInput_SetTriggerMode(volatile HSADC_ADCANCFG_t adin_cfg)
{
    volatile uint16_t fres = 1;
    volatile uint16_t regval = 0;
    volatile uint16_t ad_idx = 0;
    
    // Check if channel number exists
    if (adin_cfg.ad_input >= ADC_ANINPUT_COUNT) return(0);

    ad_idx = adin_cfg.ad_input; // Copy analog input number
    
    // Map bit on right register (HIGH or LOW)
    if (ad_idx<16) {   
        // Setting the Trigger Mode Bit
        regval = (((volatile uint16_t)adin_cfg.config.trigger_mode) << ad_idx);
        ADLVLTRGL |= (regval & REG_ADSTATL_VALID_DATA_MSK);
        fres &= (volatile bool)((ADLVLTRGL & regval) == regval); // Check if bit has been set
    }
    else {

        #ifdef ADLVLTRGH
        ad_idx -= 16;    // Scale ANx-number down into single register field
        regval = (((volatile uint16_t)adin_cfg.config.trigger_mode) << ad_idx);
        ADLVLTRGH |= (regval & REG_ADSTATH_VALID_DATA_MSK);
        fres &= (volatile bool)((ADLVLTRGH & regval) == regval); // Check if bit has been set
        #else
        return(0);  // Return ERROR if register does not exists
        #endif
    }

    // Return Success/Error bit
	return(fres);
	
}

/*!hsadc_set_adc_input_mode()
 * ************************************************************************************************
 * Summary:
 * Configures the analog input mode of an individual analog input
 *
 * Parameters:	
 *     - index: 
 *         index of the ADC input (e.g. 0 for AN, 1 for AN1, etc)
 *     - ADMOD_INPUT_MODE_e input_mode: 
 *         0 = Single-Ended
 *         1 = Differential
 *     - ADMOD_OUTPUT_DATA_MODE_e data_mode:
 *         0 = unsigned number
 *         1 = signed number
 * 
 * Returns:
 *     0: failure
 *     1: success
 * 
 * Description:
 * The individual analog inputs of the dsPIC can be configured in single-ended or differential mode.
 * Each configuration has to be considered during the hardware design to make sure the signals
 * are captured correctly.
 * This function is used to enable the desired mode by setting the related register bits.
 * ***********************************************************************************************/

volatile uint16_t ADC_ADInput_SetMode(volatile HSADC_ADCANCFG_t adin_cfg) 
{
    volatile uint16_t fres = 1;
    volatile uint16_t ad_idx=0;
    volatile uint16_t regval = 0;
    
    // Check if channel number exists
    if (adin_cfg.ad_input >= ADC_ANINPUT_COUNT) 
        return(0);

    ad_idx = adin_cfg.ad_input; // Copy analog input channel number
    
    // Build dual-bit value of settings
    regval = (volatile uint16_t)adin_cfg.config.input_mode;
    regval <<= 1;
    regval |= (volatile uint16_t)adin_cfg.config.data_mode;
    
    // Map bit on right register (HIGH or LOW)
    if (adin_cfg.ad_input<8) {   
        // Setting the analog input mode of channel 0 to 7
        ad_idx <<= 1;    // Multiply index by 2
        regval <<= ad_idx; // Shift bits up to channel index
        ADMOD0L |= (regval & REG_ADMOD0L_VALID_DATA_MSK); // write value into register
        fres &= (volatile bool)((ADMOD0L & regval) == regval); // Check if bit has been set
    }
    else if (adin_cfg.ad_input<16) {   
        // Setting the analog input mode of channel 8 to 15
        ad_idx -= 8;     // Scale ANx-number down into single register field
        ad_idx <<= 1;    // Multiply index by 2
        regval <<= ad_idx; // Shift bits up to channel index
        ADMOD0H |= (regval & REG_ADMOD0H_VALID_DATA_MSK); // write value into register
        fres &= (volatile bool)((ADMOD0H & regval) == regval); // Check if bit has been set
    }
    else if (adin_cfg.ad_input<24) {   
        // Setting the analog input mode of channel 16 to 23
        ad_idx -= 16;     // Scale ANx-number down into single register field
        ad_idx <<= 1;    // Multiply index by 2
        regval <<= ad_idx; // Shift bits up to channel index
        ADMOD1L |= (regval & REG_ADMOD1L_VALID_DATA_MSK); // write value into register
        fres &= (volatile bool)((ADMOD1L & regval) == regval); // Check if bit has been set
    }
    else {

        #if defined (ADMOD1H)
        // Setting the analog input mode of channel 24 to 31
        ad_idx -= 24;     // Scale ANx-number down into single register field
        ad_idx <<= 1;    // Multiply index by 2
        regval <<= ad_idx; // Shift bits up to channel index
        ADMOD1H |= (regval & REG_ADMOD1H_VALID_DATA_MSK); // write value into register
        fres &= (volatile bool)((ADMOD1H & regval) == regval); // Check if bit has been set
        
        #else
        fres = 0;  // Return ERROR if register does not exists
        #endif
    }


    // Return Success/Error bit
	return(fres);
	
